app/controllers/school_classes_controller.rb

    def create
        redirect_to school_class_path(SchoolClass.create(schoolclass_params(:title, :room_number)))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "EMF"], ["room_number", 1310]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(schoolclass_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 1315], ["id", 1]]