app/controllers/students_controller.rb

    def create
        redirect_to student_path(Student.create(student_params(:first_name, :last_name)))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Samuel"], ["last_name", "Desantis"], ["created_at", "2021-10-01 05:00:27.061062"], ["updated_at", "2021-10-01 05:00:27.061062"]]

    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Linda Kaitlin Glasier"], ["updated_at", "2021-10-01 05:09:34.700903"], ["id", 8]]